public class P0100_Displacement {
	public static void main(String[] args) {
		
		/*
			位移运算符
			>> 算术右移。符号位不变，低位溢出，高位符号位补充，向右移动n位
			<< 算数左移。符号位不变，低位补零，向左移动n位
			>>> 逻辑右移，也叫无符号右移。低位溢出，高位补0，，向右移动n位
			<<< 没有这个
		*/


		//int a = 1 >> 2;
		//1=>补码=原码 	00000000 00000000 00000000 00000001
		//按位右移2位 	00000000 00000000 00000000 00000000
		//反推反码正码   00000000 00000000 00000000 00000000
		//转10进制     	0
		int a = 1 >> 2;
		//向右移动两位本质是1/2/2 = 0
		System.out.println(a);


		//int b = 1 << 2;
		//1=>补码=原码 	00000000 00000000 00000000 00000001
		//按位左移2位 	00000000 00000000 00000000 00000100
		//反推反码正码   00000000 00000000 00000000 00000100
		//转10进制     	4
		int b = 1 << 2;
		//向左移动两位本质是1*2*2 = 4
		System.out.println(b);
	}
}